# Pandas

In [6]:
import pandas as pd

In [29]:
df = pd.read_excel("samples/Product_sales.xlsx")
df.loc[:, :]

,OrderID,Product,Category,Quantity,Price,Total,OrderDate,CustomerCity
0,1,Laptop,Electronics,2,800,1600,2022-01-10,New York
1,2,Smartphone,Electronics,3,600,1800,2022-02-15,Los Angeles
2,3,Desk Chair,Furniture,5,150,750,2022-03-12,Chicago
3,4,Notebook,Stationery,10,2,20,2022-04-05,Houston
4,5,Monitor,Electronics,1,300,300,2022-05-21,Miami

In [8]:
df.iloc[0,7]

'New York'

In [10]:
df.loc[0:3, ['Category', 'Price']]

      Category  Price
0  Electronics    800
1  Electronics    600
2    Furniture    150
3   Stationery      2

In [11]:
x = df[['Quantity']]

In [13]:
type(x)

pandas.core.frame.DataFrame

In [14]:
x

   Quantity
0         2
1         3
2         5
3        10
4         1

In [16]:
y = df[['Product', 'Category', 'Quantity']]
y

      Product     Category  Quantity
0      Laptop  Electronics         2
1  Smartphone  Electronics         3
2  Desk Chair    Furniture         5
3    Notebook   Stationery        10
4     Monitor  Electronics         1

In [18]:
df.iloc[1,2] #1st index row 2nd column

'Electronics'

In [21]:
df.iloc[1:4, 0:3]

   OrderID     Product     Category
1        2  Smartphone  Electronics
2        3  Desk Chair    Furniture
3        4    Notebook   Stationery

In [22]:
df.loc[0:2, 'OrderID':'Category']

   OrderID     Product     Category
0        1      Laptop  Electronics
1        2  Smartphone  Electronics
2        3  Desk Chair    Furniture

In [24]:
q = df[['Price']]
q

   Price
0    800
1    600
2    150
3      2
4    300

In [25]:
type(q)

pandas.core.frame.DataFrame

In [26]:
q = df[['Product', 'Category']]
q

      Product     Category
0      Laptop  Electronics
1  Smartphone  Electronics
2  Desk Chair    Furniture
3    Notebook   Stationery
4     Monitor  Electronics

In [28]:
df.iloc[1,2]

'Electronics'

In [32]:
new_index=['a','b','c','d','e']
df_new = df
df_new.index = new_index
df_new

,OrderID,Product,Category,Quantity,Price,Total,OrderDate,CustomerCity
a,1,Laptop,Electronics,2,800,1600,2022-01-10,New York
b,2,Smartphone,Electronics,3,600,1800,2022-02-15,Los Angeles
c,3,Desk Chair,Furniture,5,150,750,2022-03-12,Chicago
d,4,Notebook,Stationery,10,2,20,2022-04-05,Houston
e,5,Monitor,Electronics,1,300,300,2022-05-21,Miami

In [33]:
df_new.loc['a', 'CustomerCity']

'New York'

In [37]:
df_new.loc['a':'d',['CustomerCity', 'Price']]

  CustomerCity  Price
a     New York    800
b  Los Angeles    600
c      Chicago    150
d      Houston      2

## Filtering

In [38]:
data = {
    "Product": ["Laptop", "Laptop", "Mobile", "Mobile", "Tablet", "Tablet", "Headphones", "Camera"],
    "Category": ["Electronics", "Electronics", "Electronics", "Electronics", "Electronics", "Electronics", "Accessories", "Electronics"],
    "Brand": ["Dell", "HP", "Samsung", "Apple", "Lenovo", "Apple", "Sony", "Canon"],
    "Price": [55000, 62000, 18000, 70000, 25000, 30000, 4000, 45000],
    "Units_Sold": [120, 80, 150, 110, 90, 60, 200, 70],
    "City": ["Mumbai", "Delhi", "Mumbai", "Chennai", "Bangalore", "Hyderabad", "Mumbai", "Delhi"],
    "Date": [
        "2024-01-05", "2024-01-10", "2024-02-15", "2024-02-20",
        "2024-03-01", "2024-03-05", "2024-03-15", "2024-03-20"
    ]
}

In [39]:
df = pd.DataFrame(data)
df

      Product     Category    Brand  Price  Units_Sold       City        Date
0      Laptop  Electronics     Dell  55000         120     Mumbai  2024-01-05
1      Laptop  Electronics       HP  62000          80      Delhi  2024-01-10
2      Mobile  Electronics  Samsung  18000         150     Mumbai  2024-02-15
3      Mobile  Electronics    Apple  70000         110    Chennai  2024-02-20
4      Tablet  Electronics   Lenovo  25000          90  Bangalore  2024-03-01
5      Tablet  Electronics    Apple  30000          60  Hyderabad  2024-03-05
6  Headphones  Accessories     Sony   4000         200     Mumbai  2024-03-15
7      Camera  Electronics    Canon  45000          70      Delhi  2024-03-20

In [40]:
df['Date'] = pd.to_datetime(df['Date'])
df

      Product     Category    Brand  Price  Units_Sold       City       Date
0      Laptop  Electronics     Dell  55000         120     Mumbai 2024-01-05
1      Laptop  Electronics       HP  62000          80      Delhi 2024-01-10
2      Mobile  Electronics  Samsung  18000         150     Mumbai 2024-02-15
3      Mobile  Electronics    Apple  70000         110    Chennai 2024-02-20
4      Tablet  Electronics   Lenovo  25000          90  Bangalore 2024-03-01
5      Tablet  Electronics    Apple  30000          60  Hyderabad 2024-03-05
6  Headphones  Accessories     Sony   4000         200     Mumbai 2024-03-15
7      Camera  Electronics    Canon  45000          70      Delhi 2024-03-20

In [41]:
df.sort_values('Date')

      Product     Category    Brand  Price  Units_Sold       City       Date
0      Laptop  Electronics     Dell  55000         120     Mumbai 2024-01-05
1      Laptop  Electronics       HP  62000          80      Delhi 2024-01-10
2      Mobile  Electronics  Samsung  18000         150     Mumbai 2024-02-15
3      Mobile  Electronics    Apple  70000         110    Chennai 2024-02-20
4      Tablet  Electronics   Lenovo  25000          90  Bangalore 2024-03-01
5      Tablet  Electronics    Apple  30000          60  Hyderabad 2024-03-05
6  Headphones  Accessories     Sony   4000         200     Mumbai 2024-03-15
7      Camera  Electronics    Canon  45000          70      Delhi 2024-03-20

In [48]:
m = df['Date'].dt.month
m

0    1
1    1
2    2
3    2
4    3
5    3
6    3
7    3
Name: Date, dtype: int32

In [49]:
type(m)

pandas.core.series.Series

In [50]:
df['Week'] = df['Date'].dt.isocalendar().week

In [51]:
df

,Product,Category,Brand,Price,Units_Sold,City,Date,Week
0,Laptop,Electronics,Dell,55000,120,Mumbai,2024-01-05,1
1,Laptop,Electronics,HP,62000,80,Delhi,2024-01-10,2
2,Mobile,Electronics,Samsung,18000,150,Mumbai,2024-02-15,7
3,Mobile,Electronics,Apple,70000,110,Chennai,2024-02-20,8
4,Tablet,Electronics,Lenovo,25000,90,Bangalore,2024-03-01,9
5,Tablet,Electronics,Apple,30000,60,Hyderabad,2024-03-05,10
6,Headphones,Accessories,Sony,4000,200,Mumbai,2024-03-15,11
7,Camera,Electronics,Canon,45000,70,Delhi,2024-03-20,12

In [52]:
df['Month_Name'] = df['Date'].dt.month_name()
df

,Product,Category,Brand,Price,Units_Sold,City,Date,Week,Month_Name
0,Laptop,Electronics,Dell,55000,120,Mumbai,2024-01-05,1,January
1,Laptop,Electronics,HP,62000,80,Delhi,2024-01-10,2,January
2,Mobile,Electronics,Samsung,18000,150,Mumbai,2024-02-15,7,February
3,Mobile,Electronics,Apple,70000,110,Chennai,2024-02-20,8,February
4,Tablet,Electronics,Lenovo,25000,90,Bangalore,2024-03-01,9,March
5,Tablet,Electronics,Apple,30000,60,Hyderabad,2024-03-05,10,March
6,Headphones,Accessories,Sony,4000,200,Mumbai,2024-03-15,11,March
7,Camera,Electronics,Canon,45000,70,Delhi,2024-03-20,12,March

In [53]:
df['Day_Name'] = df['Date'].dt.day_name()
df

,Product,Category,Brand,Price,Units_Sold,City,Date,Week,Month_Name,Day_Name
0,Laptop,Electronics,Dell,55000,120,Mumbai,2024-01-05,1,January,Friday
1,Laptop,Electronics,HP,62000,80,Delhi,2024-01-10,2,January,Wednesday
2,Mobile,Electronics,Samsung,18000,150,Mumbai,2024-02-15,7,February,Thursday
3,Mobile,Electronics,Apple,70000,110,Chennai,2024-02-20,8,February,Tuesday
4,Tablet,Electronics,Lenovo,25000,90,Bangalore,2024-03-01,9,March,Friday
5,Tablet,Electronics,Apple,30000,60,Hyderabad,2024-03-05,10,March,Tuesday
6,Headphones,Accessories,Sony,4000,200,Mumbai,2024-03-15,11,March,Friday
7,Camera,Electronics,Canon,45000,70,Delhi,2024-03-20,12,March,Wednesday

In [54]:
df['Month_Start'] = df['Date'].dt.to_period('M').dt.start_time
df

,Product,Category,Brand,Price,Units_Sold,City,Date,Week,Month_Name,Day_Name,Month_Start
0,Laptop,Electronics,Dell,55000,120,Mumbai,2024-01-05,1,January,Friday,2024-01-01
1,Laptop,Electronics,HP,62000,80,Delhi,2024-01-10,2,January,Wednesday,2024-01-01
2,Mobile,Electronics,Samsung,18000,150,Mumbai,2024-02-15,7,February,Thursday,2024-02-01
3,Mobile,Electronics,Apple,70000,110,Chennai,2024-02-20,8,February,Tuesday,2024-02-01
4,Tablet,Electronics,Lenovo,25000,90,Bangalore,2024-03-01,9,March,Friday,2024-03-01
5,Tablet,Electronics,Apple,30000,60,Hyderabad,2024-03-05,10,March,Tuesday,2024-03-01
6,Headphones,Accessories,Sony,4000,200,Mumbai,2024-03-15,11,March,Friday,2024-03-01
7,Camera,Electronics,Canon,45000,70,Delhi,2024-03-20,12,March,Wednesday,2024-03-01

In [58]:
m = df['Date'].dt.to_period('D')
m

0    2024-01-05
1    2024-01-10
2    2024-02-15
3    2024-02-20
4    2024-03-01
5    2024-03-05
6    2024-03-15
7    2024-03-20
Name: Date, dtype: period[D]

In [61]:
new_db = pd.DataFrame(m)

In [63]:
new_db.to_csv('Date.csv')

In [64]:
df[df['Price'].between(20000, 60000)]

,Product,Category,Brand,Price,Units_Sold,City,Date,Week,Month_Name,Day_Name,Month_Start
0,Laptop,Electronics,Dell,55000,120,Mumbai,2024-01-05,1,January,Friday,2024-01-01
4,Tablet,Electronics,Lenovo,25000,90,Bangalore,2024-03-01,9,March,Friday,2024-03-01
5,Tablet,Electronics,Apple,30000,60,Hyderabad,2024-03-05,10,March,Tuesday,2024-03-01
7,Camera,Electronics,Canon,45000,70,Delhi,2024-03-20,12,March,Wednesday,2024-03-01

In [65]:
df.head()

,Product,Category,Brand,Price,Units_Sold,City,Date,Week,Month_Name,Day_Name,Month_Start
0,Laptop,Electronics,Dell,55000,120,Mumbai,2024-01-05,1,January,Friday,2024-01-01
1,Laptop,Electronics,HP,62000,80,Delhi,2024-01-10,2,January,Wednesday,2024-01-01
2,Mobile,Electronics,Samsung,18000,150,Mumbai,2024-02-15,7,February,Thursday,2024-02-01
3,Mobile,Electronics,Apple,70000,110,Chennai,2024-02-20,8,February,Tuesday,2024-02-01
4,Tablet,Electronics,Lenovo,25000,90,Bangalore,2024-03-01,9,March,Friday,2024-03-01

In [66]:
df.tail()

,Product,Category,Brand,Price,Units_Sold,City,Date,Week,Month_Name,Day_Name,Month_Start
3,Mobile,Electronics,Apple,70000,110,Chennai,2024-02-20,8,February,Tuesday,2024-02-01
4,Tablet,Electronics,Lenovo,25000,90,Bangalore,2024-03-01,9,March,Friday,2024-03-01
5,Tablet,Electronics,Apple,30000,60,Hyderabad,2024-03-05,10,March,Tuesday,2024-03-01
6,Headphones,Accessories,Sony,4000,200,Mumbai,2024-03-15,11,March,Friday,2024-03-01
7,Camera,Electronics,Canon,45000,70,Delhi,2024-03-20,12,March,Wednesday,2024-03-01

In [68]:
df[df['City'].str.startswith('C')]

,Product,Category,Brand,Price,Units_Sold,City,Date,Week,Month_Name,Day_Name,Month_Start
3,Mobile,Electronics,Apple,70000,110,Chennai,2024-02-20,8,February,Tuesday,2024-02-01

In [75]:
df.rename(columns = {'City': 'Place'}, inplace=True)
df

,Product,Category,Brand,Price,Units_Sold,Place,Date,Week,Month_Name,Day_Name,Month_Start
0,Laptop,Electronics,Dell,55000,120,Mumbai,2024-01-05,1,January,Friday,2024-01-01
1,Laptop,Electronics,HP,62000,80,Delhi,2024-01-10,2,January,Wednesday,2024-01-01
2,Mobile,Electronics,Samsung,18000,150,Mumbai,2024-02-15,7,February,Thursday,2024-02-01
3,Mobile,Electronics,Apple,70000,110,Chennai,2024-02-20,8,February,Tuesday,2024-02-01
4,Tablet,Electronics,Lenovo,25000,90,Bangalore,2024-03-01,9,March,Friday,2024-03-01
5,Tablet,Electronics,Apple,30000,60,Hyderabad,2024-03-05,10,March,Tuesday,2024-03-01
6,Headphones,Accessories,Sony,4000,200,Mumbai,2024-03-15,11,March,Friday,2024-03-01
7,Camera,Electronics,Canon,45000,70,Delhi,2024-03-20,12,March,Wednesday,2024-03-01

In [82]:
df = df.drop(columns = ['Month_Name', 'Day_Name', 'Month_Start'])

In [83]:
df

      Product     Category    Brand  Price  Units_Sold      Place       Date
0      Laptop  Electronics     Dell  55000         120     Mumbai 2024-01-05
1      Laptop  Electronics       HP  62000          80      Delhi 2024-01-10
2      Mobile  Electronics  Samsung  18000         150     Mumbai 2024-02-15
3      Mobile  Electronics    Apple  70000         110    Chennai 2024-02-20
4      Tablet  Electronics   Lenovo  25000          90  Bangalore 2024-03-01
5      Tablet  Electronics    Apple  30000          60  Hyderabad 2024-03-05
6  Headphones  Accessories     Sony   4000         200     Mumbai 2024-03-15
7      Camera  Electronics    Canon  45000          70      Delhi 2024-03-20

In [84]:
del df['Units_Sold']

In [85]:
df

      Product     Category    Brand  Price      Place       Date
0      Laptop  Electronics     Dell  55000     Mumbai 2024-01-05
1      Laptop  Electronics       HP  62000      Delhi 2024-01-10
2      Mobile  Electronics  Samsung  18000     Mumbai 2024-02-15
3      Mobile  Electronics    Apple  70000    Chennai 2024-02-20
4      Tablet  Electronics   Lenovo  25000  Bangalore 2024-03-01
5      Tablet  Electronics    Apple  30000  Hyderabad 2024-03-05
6  Headphones  Accessories     Sony   4000     Mumbai 2024-03-15
7      Camera  Electronics    Canon  45000      Delhi 2024-03-20

## Merging and Joining

In [86]:
left = pd.DataFrame({'Product':['Laptop','Mobile','Tablet'],
                     'Price':[55000,18000,25000]})
right = pd.DataFrame({'Product':['Laptop','Tablet','Camera'],
                      'Region':['West','East','North']})

In [87]:
left

  Product  Price
0  Laptop  55000
1  Mobile  18000
2  Tablet  25000

In [88]:
right

  Product Region
0  Laptop   West
1  Tablet   East
2  Camera  North

In [ ]:
merged = left.merge()